DataProcessors/ФССП_ЗагрузкаРегионов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>ФССП_ЗагрузкаРегионов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодРегиона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеРегиона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОСП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийТелефон1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодАгенства</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПочтовыйАдрес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Факс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийТелефон2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийТелефон3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Территория</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ФССП_ЗагрузкаРегионов/Ext/ManagerModule.bsl
//Перем ИмяСправочникаПриставов Экспорт ;
//Перем ИмяСправочникаССП Экспорт ;

#Область ИнтерфейсФона

Процедура ЗагрузитьДанныеРегионаВФоне(ПередаваемыеПараметры, АдресОтвета) Экспорт

	ДанныеТабличногоДокумента = ПередаваемыеПараметры["ДанныеТабличногоДокумента"];
	ПолеИсходнойТаблицы = ПолучитьФайлСоответствий(ДанныеТабличногоДокумента);
	
	НомераКолонок = ПередаваемыеПараметры["НомераКолонок"];
	
	НачатьТранзакцию();
	Попытка
	
		ЗагрузитьДанныеРегиона(ПолеИсходнойТаблицы, НомераКолонок);
	
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение ОписаниеОшибки();
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();

КонецПроцедуры

Процедура ЗагрузитьДанныеПриставовВФоне(ПередаваемыеПараметры, АдресОтвета) Экспорт

	ДанныеТабличногоДокумента = ПередаваемыеПараметры["ДанныеТабличногоДокумента"];
	ПолеИсходнойТаблицы = ПолучитьФайлСоответствий(ДанныеТабличногоДокумента);
	
	НомераКолонок = ПередаваемыеПараметры["НомераКолонок"];
	
	НачатьТранзакцию();
	Попытка
	
		// ЗагрузитьДанныеПриставов(ПолеИсходнойТаблицы, НомераКолонок);
		ОбработкаПриставы = Обработки.ФССП_ЗагрузкаСудебныхПриставов.Создать();
		ОбработкаПриставы.ЗагрузитьДанныеПриставы(ПолеИсходнойТаблицы, НомераКолонок);
	
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение ОписаниеОшибки();
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();

КонецПроцедуры

Процедура ЗагрузитьДанныеССПВФоне(ПередаваемыеПараметры, АдресОтвета) Экспорт

	ДанныеТабличногоДокумента = ПередаваемыеПараметры["ДанныеТабличногоДокумента"];
	ПолеИсходнойТаблицы = ПолучитьФайлСоответствий(ДанныеТабличногоДокумента);
	
	НомераКолонок = ПередаваемыеПараметры["НомераКолонок"];
	
	НачатьТранзакцию();
	Попытка
	
		// ЗагрузитьДанныеССП(ПолеИсходнойТаблицы, НомераКолонок);
		ОбработкаССП = Обработки.ФССП_ЗагрузкаССП.Создать();
		ОбработкаССП.ЗагрузитьДанныеССП(ПолеИсходнойТаблицы, НомераКолонок);
	
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение ОписаниеОшибки();
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();

КонецПроцедуры

#КонецОбласти

#Область Регионы

Процедура ЗагрузитьДанныеРегиона(ПолеИсходнойТаблицы, НомераКолонок) Экспорт
	ИмяСправочникаПриставов = бит_ФССП_Переопределяемый.ПолучитьИмяСправочникаСудебныеПриставы();
	ИмяСправочникаССП = бит_ФССП_Переопределяемый.ПолучитьИмяСправочникаСлужбыСудебныхПриставов();
	ТаблицаРегионовОСП = ПоискПапкиРегионаОСП();
	ТаблицаРегионовПристав = ПоискПапкиРегионаПристав();
	
	Для НомерСтроки = 2 По ПолеИсходнойТаблицы.ВысотаТаблицы Цикл
		КодРегионаЗнач = ПолеИсходнойТаблицы.Область(НомерСтроки, НомераКолонок["КодРегиона"]).Текст;
		НаименованиеРегионаЗнач = ПолеИсходнойТаблицы.Область(НомерСтроки, НомераКолонок["ИмяРегиона"]).Текст;
		Если ЗначениеЗаполнено(КодРегионаЗнач) И ЗначениеЗаполнено(НаименованиеРегионаЗнач) Тогда
			РегионПапкаССП = ТаблицаРегионовОСП.Найти(Число(КодРегионаЗнач));
			РегионПапкаПристав = ТаблицаРегионовПристав.Найти(Число(КодРегионаЗнач));
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(КодРегионаЗнач) И ЗначениеЗаполнено(НаименованиеРегионаЗнач) И РегионПапкаПристав = Неопределено Тогда
			РегионГруппаОбъект = Справочники[ИмяСправочникаПриставов].СоздатьГруппу();
			РегионГруппаОбъект.Наименование = НаименованиеРегионаЗнач;
			РегионГруппаОбъект.КодРегиона = КодРегионаЗнач;
			РегионГруппаОбъект.Записать();
			РегионГруппаОбъект = РегионГруппаОбъект.Ссылка;
		КонецЕсли;
		Если ЗначениеЗаполнено(КодРегионаЗнач) И ЗначениеЗаполнено(НаименованиеРегионаЗнач) и РегионПапкаССП = Неопределено Тогда
			РегионГруппаОбъект = Справочники[ИмяСправочникаССП].СоздатьГруппу();
			РегионГруппаОбъект.Наименование = НаименованиеРегионаЗнач;
			РегионГруппаОбъект.КодРегиона = КодРегионаЗнач;
			РегионГруппаОбъект.Записать();
			РегионГруппаОбъект = РегионГруппаОбъект.Ссылка;	
			
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ПоискПапкиРегионаОСП()

	ИмяСправочникаССП = бит_ФССП_Переопределяемый.ПолучитьИмяСправочникаСлужбыСудебныхПриставов();

	Возврат ПоискПапкиСправочника(ИмяСправочникаССП);

КонецФункции	

Функция ПоискПапкиРегионаПристав()

	ИмяСправочникаПриставов = бит_ФССП_Переопределяемый.ПолучитьИмяСправочникаСудебныеПриставы();

	Возврат ПоискПапкиСправочника(ИмяСправочникаПриставов);

КонецФункции

Функция ПоискПапкиСправочника(ИмяСправочникаПриставов)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаСправочникаССП.Ссылка КАК Ссылка,
	               |	ТаблицаСправочникаССП.КодРегиона КАК КодРегиона,
	               |	ТаблицаСправочникаССП.Наименование КАК Наименование
	               |ИЗ
	               |	&ТаблицаСправочникаССП Как ТаблицаСправочникаССП
	               |ГДЕ
	               |	ТаблицаСправочникаССП.ЭтоГруппа = ИСТИНА
	               |	И ТаблицаСправочникаССП.ПометкаУдаления = ЛОЖЬ";
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ТаблицаСправочникаССП","Справочник." + ИмяСправочникаПриставов);

	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;

КонецФункции // ()

#КонецОбласти

#Область ССП

Процедура ЗагрузитьДанныеССП(ПолеИсходнойТаблицы, НомераКолонок) Экспорт
	ИмяСправочникаССП = бит_ФССП_Переопределяемый.ПолучитьИмяСправочникаСлужбыСудебныхПриставов();
	ВидРабочий = бит_ФССП_Переопределяемый.ПолучитьВидТелефонаРабочий();
	ВидФакс = бит_ФССП_Переопределяемый.ПолучитьВидТелефонаФакс();
	Для НомерСтроки = 2 По ПолеИсходнойТаблицы.ВысотаТаблицы Цикл
		
		КодРегионаЗнач = ПолеИсходнойТаблицы.Область(НомерСтроки, НомераКолонок["КодРегиона"]).Текст;
		КодАгенстваЗнач = ПолеИсходнойТаблицы.Область(НомерСтроки, НомераКолонок["КодАгенства"]).Текст;
		НаименованиеОСПЗнач = ПолеИсходнойТаблицы.Область(НомерСтроки, НомераКолонок["НаименованиеОСП"]).Текст;
		ПочтовыйАдресЗнач = ПолеИсходнойТаблицы.Область(НомерСтроки, НомераКолонок["ПочтовыйАдрес"]).Текст;
		РуководительЗнач = ПолеИсходнойТаблицы.Область(НомерСтроки, НомераКолонок["Руководитель"]).Текст;
		РабочийТелефон1Знач = ПолеИсходнойТаблицы.Область(НомерСтроки, НомераКолонок["РабочийТелефон1"]).Текст;
		ФаксЗнач = ПолеИсходнойТаблицы.Область(НомерСтроки, НомераКолонок["Факс"]).Текст;
		РабочийТелефон2Знач = ПолеИсходнойТаблицы.Область(НомерСтроки, НомераКолонок["РабочийТелефон2"]).Текст;
		РабочийТелефон3Знач = ПолеИсходнойТаблицы.Область(НомерСтроки, НомераКолонок["РабочийТелефон3"]).Текст;
		ГрафикРаботыЗнач = ПолеИсходнойТаблицы.Область(НомерСтроки, НомераКолонок["ГрафикРаботы"]).Текст;
		ТерриторияЗнач = ПолеИсходнойТаблицы.Область(НомерСтроки, НомераКолонок["Территория"]).Текст;
		
		//РабочийТелефон1Знач = ПреобразоватьТелефон(РабочийТелефон1Знач);
		//РабочийТелефон2Знач = ПреобразоватьТелефон(РабочийТелефон2Знач);
		//РабочийТелефон3Знач = ПреобразоватьТелефон(РабочийТелефон3Знач);
		//ФаксЗнач = ПреобразоватьТелефон(ФаксЗнач);
		
		
		// Поиск Папки-региона, которая будет родителем для ОСП-элемента
		Если Не ЗначениеЗаполнено(КодРегионаЗнач) Тогда
			Прервать;
		КонецЕсли;
		
		РегионПапка = ПоискГруппыРегионаОСП(КодРегионаЗнач, ИмяСправочникаССП);//ПоискПапкиРегионаОСП(КодРегионаЗнач);
		
		Если РегионПапка = Справочники[ИмяСправочникаССП].ПустаяСсылка() Тогда
			РегионГруппаОбъект =Справочники[ИмяСправочникаССП].СоздатьГруппу();
			РегионГруппаОбъект.Наименование = КодРегионаЗнач;
			РегионГруппаОбъект.КодРегиона = КодРегионаЗнач;
			РегионГруппаОбъект.Записать();
			ПапкаРегиона = РегионГруппаОбъект.Ссылка;
		Иначе
			ПапкаРегион = РегионПапка;
		КонецЕсли;
		
		ОСП = ПоискВРегионеОСП(КодРегионаЗнач, КодАгенстваЗнач, ИмяСправочникаССП);
		
		Если ОСП <> Справочники[ИмяСправочникаССП].ПустаяСсылка()  Тогда
				ОСП_Объект = ОСП.ПолучитьОбъект();
				ОСП_Объект.Наименование = НаименованиеОСПЗнач; 
				ОСП_Объект.НаименованиеПолное = НаименованиеОСПЗнач;
				ОСП_Объект.ПочтовыйАдрес = ПочтовыйАдресЗнач;
				ОСП_Объект.Руководитель = РуководительЗнач;
				ОСП_Объект.ГрафикРаботы = ГрафикРаботыЗнач;
				ОСП_Объект.ТерриторияОбслуживания = ТерриторияЗнач;
				
				//ОСП_Объект.ТелефоныИФаксы.Очистить();
				
				МассивРабочихТелефонов = Новый Массив;
				МассивРабочихТелефонов.Добавить(РабочийТелефон1Знач);
				МассивРабочихТелефонов.Добавить(РабочийТелефон2Знач);
				МассивРабочихТелефонов.Добавить(РабочийТелефон3Знач);
				МассивПоделенныхРабочихТелефонов = Новый Массив;
				
				Для Каждого строка из МассивРабочихТелефонов Цикл
					МассивПоделенныхРабочихТелефонов = РазбитьРабочиеТелефоны(строка);
					Для каждого тел из МассивПоделенныхРабочихТелефонов Цикл
						БезСимволов = ПреобразоватьТелефон(тел); 
						НайденнаяСтрока = ОСП_Объект.Телефоны.Найти(Прав(БезСимволов, 10), бит_ФССП_Переопределяемый.ПолучитьКолонкуТЧТелефоны());
						Если НайденнаяСтрока = Неопределено Тогда
							Телефон = ОСП_Объект.Телефоны.Добавить();
							бит_ФССП_Переопределяемый.ОбработатьНомерТелефона(Телефон,тел);
							//УправлениеКонтактнойИнформацией.РазбитьНомерТелефонаНаСоставляющие(Телефон,тел);
							Телефон.ВидТелефона = ВидРабочий;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
				
				Если ЗначениеЗаполнено(ФаксЗнач) Тогда
					МассивФаксов = РазбитьРабочиеТелефоны(ФаксЗнач);
					Для Каждого номер из МассивФаксов Цикл
						БезСимволов = ПреобразоватьТелефон(номер); 
						НайденнаяСтрока = ОСП_Объект.Телефоны.Найти(Прав(БезСимволов, 10),бит_ФССП_Переопределяемый.ПолучитьКолонкуТЧТелефоны());
						Если НайденнаяСтрока = Неопределено Тогда
							ТелефонФакс = ОСП_Объект.Телефоны.Добавить();
							//ТелефонФакс.ВидТелефона = ВидФакс;
							бит_ФССП_Переопределяемый.ОбработатьНомерТелефона(ТелефонФакс,номер);
							ТелефонФакс.ВидТелефона = Справочники.ВидыТелефонов.Факс;
							//УправлениеКонтактнойИнформацией.РазбитьНомерТелефонаНаСоставляющие(ТелефонФакс,номер);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;

				ОСП_Объект.Записать();
			
		Иначе	
			//Теперь Создаем ОСП, где родитель - переменная ПапкаРегион 
			Если ЗначениеЗаполнено(КодРегионаЗнач) и ЗначениеЗаполнено(НаименованиеОСПЗнач) Тогда
				ОСП_Объект = Справочники[ИмяСправочникаССП].СоздатьЭлемент();
				ОСП_Объект.КодРегиона = КодРегионаЗнач;
				ОСП_Объект.КодТерриториальногоАгенства = КодАгенстваЗнач;
				ОСП_Объект.Наименование = НаименованиеОСПЗнач;
				ОСП_Объект.НаименованиеПолное = НаименованиеОСПЗнач;
				ОСП_Объект.ПочтовыйАдрес = ПочтовыйАдресЗнач;
				ОСП_Объект.Руководитель = РуководительЗнач;
				ОСП_Объект.ГрафикРаботы = ГрафикРаботыЗнач;
				ОСП_Объект.ТерриторияОбслуживания = ТерриторияЗнач;
				ОСП_Объект.Родитель = ПапкаРегион;
				
				//СтрокаРабочихТелефонов = РабочийТелефон1Знач+","+РабочийТелефон2Знач+","+ РабочийТелефон3Знач;
				
				Если ЗначениеЗаполнено(РабочийТелефон1Знач) Тогда
					СтрокаРабочихТелефонов = РабочийТелефон1Знач+",";
				КонецЕсли;
				Если ЗначениеЗаполнено(РабочийТелефон2Знач) Тогда
					СтрокаРабочихТелефонов = Строка(СтрокаРабочихТелефонов) +РабочийТелефон2Знач+",";
				КонецЕсли;
				Если ЗначениеЗаполнено(РабочийТелефон3Знач) Тогда
					СтрокаРабочихТелефонов = Строка(СтрокаРабочихТелефонов) +РабочийТелефон3Знач;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаРабочихТелефонов) Тогда
					МассивПоделенныхРабочихТелефонов = РазбитьРабочиеТелефоны(СтрокаРабочихТелефонов);
					ТелБезСимволов = Новый Массив;
					Для Каждого стр из МассивПоделенныхРабочихТелефонов цикл
						Если ЗначениеЗаполнено(стр) Тогда
							стр = ПреобразоватьТелефон(стр);
							ТелБезСимволов.Добавить(стр);
						КонецЕсли;
					КонецЦикла;
					ТелБезСимволов = УдалитьПовторяющиесяЭлементыМассива(ТелБезСимволов);
					
					Для каждого тел из ТелБезСимволов Цикл
						Телефон = ОСП_Объект.Телефоны.Добавить();
						Бит_ФССП_переопределяемый.ОбработатьНомерТелефона(Телефон,тел);
						//УправлениеКонтактнойИнформацией.РазбитьНомерТелефонаНаСоставляющие(Телефон,тел);
						Телефон.ВидТелефона = ВидРабочий;
					КонецЦикла;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ФаксЗнач) Тогда
					МассивФаксов = РазбитьРабочиеТелефоны(ФаксЗнач);
					МассивФаксов = УдалитьПовторяющиесяЭлементыМассива(МассивФаксов);
					Для Каждого номер из МассивФаксов Цикл
						ТелефонФакс = ОСП_Объект.Телефоны.Добавить();
						//ТелефонФакс.ВидТелефона = ВидФакс;
						Бит_ФССП_переопределяемый.ОбработатьНомерТелефона(ТелефонФакс,номер);
						ТелефонФакс.ВидТелефона = Справочники.ВидыТелефонов.Факс;
						//УправлениеКонтактнойИнформацией.РазбитьНомерТелефонаНаСоставляющие(ТелефонФакс,номер);
					КонецЦикла;
				КонецЕсли;
				
				
				ОСП_Объект.Записать();
			КонецЕсли;	
		КонецЕсли;		
	КонецЦикла;	
КонецПроцедуры

Функция ПоискГруппыРегионаОСП(НомерРегиона, ИмяСправочникаССП)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СлужбыСудебныхПриставов.Ссылка КАК Ссылка,
	               |	СлужбыСудебныхПриставов.КодРегиона КАК КодРегиона,
	               |	СлужбыСудебныхПриставов.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник."+ИмяСправочникаССП+" КАК СлужбыСудебныхПриставов
	               |ГДЕ
	               |	СлужбыСудебныхПриставов.ЭтоГруппа = ИСТИНА
	               |	И СлужбыСудебныхПриставов.КодРегиона = &КодРегиона
	               |	И СлужбыСудебныхПриставов.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("КодРегиона",Число(НомерРегиона));
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка;
	Иначе
		Возврат Справочники[ИмяСправочникаССП].ПустаяСсылка();
	КонецЕсли;	
	
КонецФункции	

Функция ПоискВРегионеОСП(Регион, Название, ИмяСправочникаССП)
	Запрос = Новый Запрос;

	Запрос.Текст = "ВЫБРАТЬ
	               |	СлужбыСудебныхПриставов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник."+ИмяСправочникаССП+" КАК СлужбыСудебныхПриставов
	               |ГДЕ
	               |	СлужбыСудебныхПриставов.КодРегиона = &КодРегиона
	               |	И СлужбыСудебныхПриставов.КодТерриториальногоАгенства = &КодТерриториальногоАгенства
				   |	И СлужбыСудебныхПриставов.ЭтоГруппа = ЛОЖЬ
				   |	И СлужбыСудебныхПриставов.ПометкаУдаления = ЛОЖЬ";

	Запрос.УстановитьПараметр("КодРегиона",Число(Регион));
	Запрос.УстановитьПараметр("КодТерриториальногоАгенства",Название);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка;
	КонецЕсли;
	
	Возврат Справочники[ИмяСправочникаССП].ПустаяСсылка();
	
КонецФункции






#КонецОбласти

#Область Приставы

Процедура ЗагрузитьДанныеПриставов(ПолеИсходнойТаблицы, НомераКолонок) Экспорт
	ИмяСправочникаПриставов = бит_ФССП_Переопределяемый.ПолучитьИмяСправочникаСудебныеПриставы();
	ИмяСправочникаССП = бит_ФССП_Переопределяемый.ПолучитьИмяСправочникаСлужбыСудебныхПриставов();
	ВидТелефона = бит_ФССП_Переопределяемый.ПолучитьВидТелефонаРабочий();
	//Получить Список Регионов-папок
	ТаблицаРегионов = ПоискПапкиРегионаОСППоРодителю(ИмяСправочникаПриставов); 
	
	//Получить список ОСП-элементов                                              
	ТаблицаОСПЭлементов = ЕстьТакойОСП(ИмяСправочникаССП);
	//Получить список ОСП-папок
	ТаблицаОСПГрупп = ЕстьТакаяПапка(ИмяСправочникаПриставов);
	
	Для НомерСтроки = 2 По ПолеИсходнойТаблицы.ВысотаТаблицы Цикл
		
		КодРегионаЗнач = ПолеИсходнойТаблицы.Область(НомерСтроки, НомераКолонок["КодРегиона"]).Текст;
		НаименованиеОСПЗнач = ПолеИсходнойТаблицы.Область(НомерСтроки, НомераКолонок["НаименованиеОСП"]).Текст;
		ДолжностьЗнач = ПолеИсходнойТаблицы.Область(НомерСтроки, НомераКолонок["Должность"]).Текст;
		ФИОЗнач = ПолеИсходнойТаблицы.Область(НомерСтроки, НомераКолонок["ФИО"]).Текст;
		РабочийТелефон1Знач = ПолеИсходнойТаблицы.Область(НомерСтроки, НомераКолонок["РабочийТелефон1"]).Текст;
		
		ФамилияИО = СократитьИмя(ФИОЗнач);
		
		 //Поиск Папки-региона, которая будет родителем для ОСП-ПАПКИ
		Если ЗначениеЗаполнено(КодРегионаЗнач) Тогда
			РегионПапка = ТаблицаРегионов.Найти(Число(КодРегионаЗнач));
		Иначе Продолжить;
		КонецЕсли;
		
		Если РегионПапка = Неопределено Тогда
			РегионГруппаОбъект = Справочники[ИмяСправочникаПриставов].СоздатьГруппу();
			РегионГруппаОбъект.Наименование = КодРегионаЗнач;
			РегионГруппаОбъект.КодРегиона = КодРегионаЗнач;
			РегионГруппаОбъект.Записать();
			ПапкаРегиона = РегионГруппаОбъект.Ссылка;
		Иначе
			ПапкаРегиона = РегионПапка.Ссылка;
		КонецЕсли;
	    // Поиск осп среди элементов справочника СлужбыСудебныхПриставов
		Отбор = Новый Структура;
    	Отбор.Вставить("КодРегиона", Число(КодРегионаЗнач));
		Отбор.Вставить("НаименованиеПолное",НаименованиеОСПЗнач);
		ОСП = ТаблицаОСПЭлементов.НайтиСтроки(Отбор);
		Если ОСП.Количество() > 0  Тогда
			//Если есть ОСП, есть ли его папка в справочнике приставов
			Отбор = Новый Структура;
			Отбор.Вставить("КодРегиона", Число(КодРегионаЗнач));
			Отбор.Вставить("ПолноеНаименованиеССП",НаименованиеОСПЗнач);
			//ОСП_Группа = ЕстьТакаяПапка(КодРегионаЗнач,НаименованиеОСПЗнач);
			ОСП_Группа = ТаблицаОСПГрупп.НайтиСтроки(Отбор);
			Если ОСП_Группа.Количество() > 0 Тогда  //ОСП_Группа <> Справочники.СудебныеПриставы.ПустаяСсылка()
				// Если есть осп-элемент и есть осп-папка
				ОСП_Папка = ОСП_Группа[0].Ссылка;
			Иначе
				//Если есть осп-элемент, но нет осп-папки
				ОСП_ПапкаОбъект = Справочники[ИмяСправочникаПриставов].СоздатьГруппу();
				ОСП_ПапкаОбъект.КодРегиона = КодРегионаЗнач;
				ОСП_ПапкаОбъект.Наименование = НаименованиеОСПЗнач;
				ОСП_ПапкаОбъект.ПолноеНаименованиеССП = НаименованиеОСПЗнач;
				ОСП_ПапкаОбъект.Родитель = ПапкаРегиона;
				ОСП_ПапкаОбъект.Записать();
				ОСП_Папка = ОСП_ПапкаОбъект.Ссылка;
				//Таблица = Новый ТаблицаЗначений;
				НоваястрОСП = ТаблицаОСПГрупп.Добавить();
				НоваяСтрОСП.Ссылка= ОСП_Папка;
				НоваяСтрОСП.Наименование = ОСП_ПапкаОбъект.Наименование;
				НоваяСтрОСП.ПолноеНаименованиеССП = ОСП_ПапкаОбъект.ПолноеНаименованиеССП;
				НоваяСтрОСП.КодРегиона = ОСП_ПапкаОбъект.КодРегиона;
			КонецЕсли;
		Иначе
			//Если нет осп-элемента, идем к следующей строке дальше
			Продолжить;
		КонецЕсли;
		
		
		//Поиск пристава
		
		Пристав = ЕстьТакойПристав(КодРегионаЗнач,НаименованиеОСПЗнач,ФИОЗнач, ИмяСправочникаПриставов);
		
		Если Пристав <> Справочники[ИмяСправочникаПриставов].ПустаяСсылка() Тогда
			//Есть пристав, перезаписываем

			ПриставОбъект = Пристав.ПолучитьОбъект();
			//ПриставОбъект = Справочники.СудебныеПриставы.СоздатьЭлемент();
			ПриставОбъект.Наименование = ФИОЗнач;
			//ПриставОбъект.Родитель = ОСП_Папка;
			ПриставОбъект.Должность = ДолжностьЗнач;
			ПриставОбъект.ФамилияИО = ФамилияИО;
			
			Если ЗначениеЗаполнено(РабочийТелефон1Знач) Тогда
				БезСимволов = ПреобразоватьТелефон(РабочийТелефон1Знач); 
				НайденнаяСтрока = ПриставОбъект.Телефоны.Найти(Прав(БезСимволов, 10), бит_ФССП_Переопределяемый.ПолучитьКолонкуТЧТелефоны());
				Если НайденнаяСтрока = Неопределено Тогда
					Телефон = ПриставОбъект.Телефоны.Добавить();
					бит_ФССП_Переопределяемый.ОбработатьНомерТелефона(Телефон,БезСимволов);
					//УправлениеКонтактнойИнформацией.РазбитьНомерТелефонаНаСоставляющие(Телефон,БезСимволов);
					Телефон.ВидТелефона = ВидТелефона;
				КонецЕсли;
			КонецЕсли;
			ПриставОбъект.Записать();

		Иначе
			//Нет пристава, создаем, Родитель = ОСП_Папка
			ПриставОбъект = Справочники[ИмяСправочникаПриставов].СоздатьЭлемент();
			ПриставОбъект.Наименование = ФИОЗнач;
			ПриставОбъект.Родитель = ОСП_Папка;
			ПриставОбъект.Должность = ДолжностьЗнач;
			ПриставОбъект.ФамилияИО = ФамилияИО;
			
			Если ЗначениеЗаполнено(РабочийТелефон1Знач) Тогда
				БезСимволов = ПреобразоватьТелефон(РабочийТелефон1Знач); 
				НайденнаяСтрока = ПриставОбъект.Телефоны.Найти(Прав(БезСимволов, 10), бит_ФССП_Переопределяемый.ПолучитьКолонкуТЧТелефоны());
				Если НайденнаяСтрока = Неопределено Тогда
					Телефон = ПриставОбъект.Телефоны.Добавить();
					бит_ФССП_Переопределяемый.ОбработатьНомерТелефона(Телефон,БезСимволов);
					//УправлениеКонтактнойИнформацией.РазбитьНомерТелефонаНаСоставляющие(Телефон,БезСимволов);
					Телефон.ВидТелефона = ВидТелефона;
				КонецЕсли;
			КонецЕсли;
			ПриставОбъект.Записать();
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

Функция ПоискПапкиРегионаОСППоРодителю(Родитель)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СудебныеПриставы.Ссылка КАК Ссылка,
	               |	СудебныеПриставы.КодРегиона КАК КодРегиона,
	               |	СудебныеПриставы.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник."+ Родитель +" КАК СудебныеПриставы
	               |ГДЕ
	               |	СудебныеПриставы.ЭтоГруппа = ИСТИНА
	               |	И СудебныеПриставы.ПометкаУдаления = ЛОЖЬ
				   | 	И СудебныеПриставы.Родитель = &Родитель";
	
	Запрос.УстановитьПараметр("Родитель", Справочники[Родитель].ПустаяСсылка());
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат; 	
КонецФункции

Функция ЕстьТакойОСП(ИмяСправочникаССП)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СлужбыСудебныхПриставов.Ссылка КАК Ссылка,
	               |	СлужбыСудебныхПриставов.Наименование КАК Наименование,
	               |	СлужбыСудебныхПриставов.КодРегиона КАК КодРегиона,
	               |	СлужбыСудебныхПриставов.КодТерриториальногоАгенства КАК КодТерриториальногоАгенства,
	               |	СлужбыСудебныхПриставов.НаименованиеПолное КАК НаименованиеПолное
	               |ИЗ
	               |	Справочник."+ИмяСправочникаССП+" КАК СлужбыСудебныхПриставов
	               |ГДЕ
	               |	СлужбыСудебныхПриставов.ЭтоГруппа = ЛОЖЬ
	               |	И СлужбыСудебныхПриставов.ПометкаУдаления = ЛОЖЬ";
	
	//Запрос.УстановитьПараметр("Наименование",Название);
	//Запрос.УстановитьПараметр("КодРегиона",Число(Регион));
	
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
		
КонецФункции

Функция ЕстьТакаяПапка(ИмяСправочникаПриставов)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СудебныеПриставы.Ссылка КАК Ссылка,
	               |	СудебныеПриставы.Наименование КАК Наименование,
	               |	СудебныеПриставы.КодРегиона КАК КодРегиона,
	               |	СудебныеПриставы.ПолноеНаименованиеССП КАК ПолноеНаименованиеССП
	               |ИЗ
	               |	Справочник."+ИмяСправочникаПриставов+" КАК СудебныеПриставы
	               |ГДЕ
	               |	СудебныеПриставы.ЭтоГруппа = ИСТИНА
	               |	И СудебныеПриставы.ПометкаУдаления = ЛОЖЬ";
	
	
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;	
КонецФункции




Функция СократитьИмя(СтрокаФИО)
	ИмяП = СтрокаФИО;
	ИмяП = СтрЗаменить(ИмяП,"."," ");
	ИмяП = СтрЗаменить(ИмяП,"  "," ");
	
	Если Лев(ИмяП,1) = " " Тогда
		ИмяП = Прав(ИмяП, СтрДлина(ИмяП)-1);
	КонецЕсли;
	ИмяП = СтрЗаменить(ИмяП, " ",Символы.ПС);
	ЧислоСтрок = СтрЧислоСтрок(ИмяП);
	
	Фамилия = СтрПолучитьСтроку(ИмяП,1);
	Имя = СтрПолучитьСтроку(ИмяП,2);
	Отчество = СтрПолучитьСтроку(ИмяП,3);
	
	ФамилияИнициалы = Фамилия;
	Если СтрДлина(Имя) > 0 Тогда
		ФамилияИнициалы = ФамилияИнициалы + "_" + Лев(Имя,1);
	КонецЕсли;
	
	Если СтрДлина(Отчество) > 0 Тогда
		ФамилияИнициалы = ФамилияИнициалы + "_" + Лев(Отчество,1);
	КонецЕсли;
	Возврат(ФамилияИнициалы);
КонецФункции

Функция ЕстьТакойПристав(Регион,НазваниеОСП,ИмяПристава, ИмяСправочникаПриставов)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СудебныеПриставы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник."+ИмяСправочникаПриставов+" КАК СудебныеПриставы
	               |ГДЕ
	               |	СудебныеПриставы.Наименование = &Наименование
	               |	И СудебныеПриставы.Родитель.Наименование = &ОСП
	               |	И СудебныеПриставы.Родитель.Родитель.КодРегиона = &КодРегиона
	               |	И СудебныеПриставы.ПометкаУдаления = ЛОЖЬ
	               |	И СудебныеПриставы.ЭтоГруппа = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Наименование",ИмяПристава);
	Запрос.УстановитьПараметр("КодРегиона",Число(Регион));
	Запрос.УстановитьПараметр("ОСП",НазваниеОСП);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка;
	Иначе
		Возврат Справочники[ИмяСправочникаПриставов].ПустаяСсылка();
	КонецЕсли;	
КонецФункции

#КонецОбласти

#Область Общее

Функция ПолучитьФайлСоответствий(ДанныеСоответствий)

	Попытка
	
		ТабличныйДокумент = УправлениеЗагрузкойСервер.ПолучитьТабличныйДокументИзФайлаХранилища(
			ДанныеСоответствий["Имя"]
		);
	
	Исключение
		ВызватьИсключение "Не удалось получить таблицу: " + ОписаниеОшибки();
	КонецПопытки;
	
	Возврат ТабличныйДокумент;

КонецФункции // ()

Функция УдалитьПовторяющиесяЭлементыМассива(Массив) Экспорт 
	
	
	ТекущийИндекс = 0; 
	
	
	ВсегоЭлементов = Массив.Количество(); 
	
	
	Пока ТекущийИндекс < ВсегоЭлементов Цикл 
		
		
		Индекс2 = ТекущийИндекс + 1; 
		
		
		Пока Индекс2 < ВсегоЭлементов Цикл 
			
			
			Если Массив[Индекс2] = Массив[ТекущийИндекс] Тогда 
				
				
				Массив.Удалить(Индекс2); 
				
				
				ВсегоЭлементов = ВсегоЭлементов - 1; 
				
				
			Иначе 
				
				
				Индекс2 = Индекс2 + 1; 
				
				
			КонецЕсли; 
			
			
		КонецЦикла; 
		
		
		ТекущийИндекс = ТекущийИндекс + 1; 
		
		
	КонецЦикла; 
	
	
	Возврат Массив; 
	
	
КонецФункции 

функция РазбитьРабочиеТелефоны(НомерТелефона) 
	ИсходнаяСтрока = Строка(НомерТелефона);
	//ИсходнаяСтрока = "999999;99999;666666;888888";
	Массив = Новый Массив;
	Пока Истина Цикл
		Поз = Найти(ИсходнаяСтрока, ",");
		Если Поз = 0 Тогда
			Телефон = ИсходнаяСтрока;
		Иначе
			Телефон = Лев(ИсходнаяСтрока,Поз-1);
		КонецЕсли;
		Массив.Добавить(Телефон);
		Если СтрДлина(Телефон) = СтрДлина(ИсходнаяСтрока) Тогда
			Прервать;
		КонецЕсли;
		
		ИсходнаяСтрока = Сред(ИсходнаяСтрока,СтрДлина(Телефон)+2);
	КонецЦикла;
	Возврат Массив;
КонецФункции

Функция ПреобразоватьТелефон(СтрТелефон)
	УдалитьПробел = СтрЗаменить(СтрТелефон," ","");
	УдалитьСимвол = СтрЗаменить(УдалитьПробел,Символы.НПП,"");
	УдалитьСкобки = СтрЗаменить(УдалитьСимвол,"(","");
	УдалитьСкобки = СтрЗаменить(УдалитьСкобки,")","");
	УдалитьПлюс = СтрЗаменить(УдалитьСкобки,"+","");
	УдалитьРавно = СтрЗаменить(УдалитьПлюс,"=","");
	УдалитьТире = СтрЗаменить(УдалитьРавно,"-","");
	
	ДлинаСтроки = СтрДлина(УдалитьТире);
	СтрокаПроверки = "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЫЬЪЭЮЯABCDEFGHIJKLMNOPQRSTUVWXYZ";
	ТелефонМассив = Новый Массив;
	
	Для Счетчик = 1 по ДлинаСтроки Цикл
		ТелефонМассив.Добавить(Сред(УдалитьТире,Счетчик,1));
	КонецЦикла;	
	
	
	Для каждого символ из ТелефонМассив Цикл
		Если стрНайти(СтрокаПроверки,Символ,,,) = 0 Тогда
			СтрокаТелефонБезСимволов = Строка(СтрокаТелефонБезСимволов)+Символ;
		КонецЕсли;
	КонецЦикла;	
	
	Возврат СтрокаТелефонБезСимволов;
КонецФункции	





#КонецОбласти
